In [1]:
import pandas as pd
df = pd.read_csv('data_folder/weather.csv')

In [2]:
df

        day  temprature  windspeed  event
0  01/01/17          32          6   Rain
1  01/02/17          35          7  Sunny
2  01/03/27          28          2   Snow
3  01/04/17          24          7   Snow
4  01/05/17          32          4   Rain
5  01/06/17          32          2  Sunny

In [3]:
a_dict = {"day": ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
         "temprature": [32, 35, 28, 24, 32, 32],
         "windspeed": [6, 7, 2, 7, 4, 2],
         "event": ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']}

In [4]:
df = pd.DataFrame(a_dict)

In [5]:
df

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          32          2  Sunny

In [6]:
# to check the dimension of a dataframe
df.shape

(6, 4)

In [7]:
rows, columns = df.shape

In [8]:
rows

6

In [9]:
columns

4

In [10]:
# how to get few rows and columns.
df.head()

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain

In [11]:
# to print only 2 rows
df.head(2)

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny

In [12]:
# get rows from the last.
df.tail()

        day  temprature  windspeed  event
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          32          2  Sunny

In [13]:
# get the two rows from the last.
df.tail(2)

        day  temprature  windspeed  event
4  1/5/2017          32          4   Rain
5  1/6/2017          32          2  Sunny

In [14]:
# print the dataframe from row number 2 to 4
df[2:5]

        day  temprature  windspeed event
2  1/3/2017          28          2  Snow
3  1/4/2017          24          7  Snow
4  1/5/2017          32          4  Rain

In [16]:
df[:]

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          32          2  Sunny

In [18]:
df.loc[:, 'temprature':'event']

   temprature  windspeed  event
0          32          6   Rain
1          35          7  Sunny
2          28          2   Snow
3          24          7   Snow
4          32          4   Rain
5          32          2  Sunny

In [19]:
df.loc[2:4]

        day  temprature  windspeed event
2  1/3/2017          28          2  Snow
3  1/4/2017          24          7  Snow
4  1/5/2017          32          4  Rain

In [20]:
df.iloc[2:5]

        day  temprature  windspeed event
2  1/3/2017          28          2  Snow
3  1/4/2017          24          7  Snow
4  1/5/2017          32          4  Rain

In [22]:
df.iloc[:, 0:3]

        day  temprature  windspeed
0  1/1/2017          32          6
1  1/2/2017          35          7
2  1/3/2017          28          2
3  1/4/2017          24          7
4  1/5/2017          32          4
5  1/6/2017          32          2

In [23]:
# code to get the list of columns.
df.columns

Index(['day', 'temprature', 'windspeed', 'event'], dtype='object')

In [25]:
# code to get the content of any column of a dataframe.
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [27]:
# code to check the type of the column of a dataframe 
type(df['event'])

pandas.core.series.Series

In [28]:
# code to get numbers of columns of a dataframe.
df[['day', 'event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [30]:
# code to get maximum temprature.
df['temprature'].max()

35

In [31]:
# to get average
df['temprature'].mean()

30.5

In [32]:
# to get minimum value
df['temprature'].min()

24

In [33]:
# code to get standard deviation.
df['temprature'].std()

3.8858718455450894

In [34]:
df.describe()

       temprature  windspeed
count    6.000000   6.000000
mean    30.500000   4.666667
std      3.885872   2.338090
min     24.000000   2.000000
25%     29.000000   2.500000
50%     32.000000   5.000000
75%     32.000000   6.750000
max     35.000000   7.000000

In [36]:
# code to get the dataframe where temprature is greater that 32
df[df['temprature'] >= 32]

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
4  1/5/2017          32          4   Rain
5  1/6/2017          32          2  Sunny

In [38]:
# code to get dataframe where temprature is maximum.
df[df['temprature'] == df['temprature'].max()]

# another way
df[df['temprature'] == df.temprature.max()]

        day  temprature  windspeed  event
1  1/2/2017          35          7  Sunny

In [39]:
df[['day', 'event']][df['temprature'] == df.temprature.max()]

        day  event
1  1/2/2017  Sunny

In [41]:
# code to get index of the dataframe.
df.index

RangeIndex(start=0, stop=6, step=1)

In [43]:
# code to change the index of dataframe.
df.set_index('day', inplace=True)

In [44]:
df

          temprature  windspeed  event
day
1/1/2017          32          6   Rain
1/2/2017          35          7  Sunny
1/3/2017          28          2   Snow
1/4/2017          24          7   Snow
1/5/2017          32          4   Rain
1/6/2017          32          2  Sunny

In [45]:
df.loc['1/5/2017']

temprature      32
windspeed        4
event         Rain
Name: 1/5/2017, dtype: object

In [46]:
# code to reset the dataframe.
df.reset_index(inplace=True)

In [47]:
df

        day  temprature  windspeed  event
0  1/1/2017          32          6   Rain
1  1/2/2017          35          7  Sunny
2  1/3/2017          28          2   Snow
3  1/4/2017          24          7   Snow
4  1/5/2017          32          4   Rain
5  1/6/2017          32          2  Sunny

In [48]:
df.set_index('event', inplace=True)

In [50]:
df

            day  temprature  windspeed
event
Rain   1/1/2017          32          6
Sunny  1/2/2017          35          7
Snow   1/3/2017          28          2
Snow   1/4/2017          24          7
Rain   1/5/2017          32          4
Sunny  1/6/2017          32          2

In [52]:
df.loc['Snow']

            day  temprature  windspeed
event
Snow   1/3/2017          28          2
Snow   1/4/2017          24          7